# # 1. 정수형과 정수형 연산
# # 덧셈
# print(4 + 7)
#
# # 뺄셈
# print(2 - 4)
#
# # 곱셈
# print(5 * 3)
#
# # 나머지
# print(7 % 3)
#
# # 거듭제곱
# print(2 ** 3)
#
#
# # 2. 소수형과 소수형 연산
# # 덧셈
# print(4.0 + 7.0)
#
# # 뺄셈
# print(2.0 - 4.0)
#
# # 곱셈
# print(5.0 * 3.0)
#
# # 나머지
# print(7.0 % 3.0)
#
# # 거듭제곱
# print(2.0 ** 3.0)
#
#
# # 정수형과 소수형 연산
# # 덧셈
# print(4 + 7.0)
#
# # 뺄셈
# print(2.0 - 4)
#
# # 곱셈
# print(5.0 * 3)
#
# # 나머지
# print(7 % 3.0)
#
# # 거듭제곱
# print(2.0 ** 3)
#
#
# # 4. 나눗셈
# print(7 / 2)
# print(6 / 2)
# print(7.0 / 2)
# print(6.0 / 2.0)
#
#
# # 5. 사칙연산 순서
# print(2 + 3 * 2)
# print(2 * (2 + 3))


# 6. floor division (버림 나눗셈)
print(7 // 2)
print(8 // 3)
print(8.0 // 3)
print(8.0 // 3.0)q


# 7. round (반올림)
print(round(3.1415926535, 4))